//1.什么是封装

/**
 *封装是把过程和数据包围起来，对数据的访问只能通过已定义的接口。
 * 面向对象计算始于这个基本概念，即现实世界可以被描绘成一系列完全自治、封装的对象，这些对象通过一个受保护的接口访问其他对象。
 * 封装是一种信息隐藏技术，在java中通过关键字private，protected和public实现封装。
 * 封装把对象的所有组成部分组合在一起，封装实际上使用方法将类的数据隐藏起来，控制用户对类的修改和访问数据的程度。
 * 适当的封装可以让程式码更容易理解和维护.
 * 加强了程式码的安全性。
 *
 *1. 良好的封装能够减少耦合。
 *2. 类内部的结构可以自由修改。
 *3. 可以对成员变量进行更精确的控制。
 *4. 隐藏信息，实现细节。
 */

//2.什么是继承

/**
 * 继承是从已有的类中派生出新的类，新的类能吸收已有类的数据属性和行为，并能扩展新的能力。
 * Java继承是使用已存在的类的定义作为基础建立新类的技术，新类的定义可以增加新的数据或新的功能，也可以用父类的功能，但不能选择性地继承父类。
 * 继承简化了人们对事物的认识和描述，能清晰体现相关类间的层次结构关系。
 * 继承提供了软件复用功能。
 * 继承通过增强一致性来减少模块间的接口和界面，大大增加了程序的易维护性。
 * 提供多重继承机制。
 */
